:PROPERTIES:
:ID:       965c9ac7-0ec9-42ba-9f4b-431d977535d4
:END:
#+TITLE: Optimal selection
#+FILETAGS: :problem: :SPOP: :statmech:
#+SETUPFILE: ~/.config/emacs/setup/setupfile.org
#+BEGIN: clocktable :maxlevel 2 :scope nil :emphasize nil
#+CAPTION: Clock summary at [2024-04-12 Fri 19:11]
| Headline              | Time   |
|-----------------------+--------|
| *Total time*          | *0:26* |
|-----------------------+--------|
| 2.4 Optimal selection | 0:26   |
#+END
* 2.4 Optimal selection
:LOGBOOK:
CLOCK: [2024-04-12 Fri 18:45]--[2024-04-12 Fri 19:11] =>  0:26
:END:
*In many specialized populations, there is little variability among the members. Is this a natural consequence of optimal selection?*
** 2.4.1
*Let* \( \{r_a\} \) *be* \( n \) *random numbers, each independently chosen from a probability density* \( p(r) \), *with* \( r \) *in* \([0, 1]\). *Calculate the probability density* \( P_n \,(x) \) *for the largest value of* \(r\) *in the set* \(\{r_1, \ldots, r_n\}\).

Without lass of generality let \(x=r_n=\max \left\{r_\alpha\right\}\) where \(\alpha=1,\,2,\,\ldots,\,n\). Because no index is any more likely to be the maximum than any other index, we have

\begin{aligned}
p_n(x)=\left[\prod_{i=1}^{n-1} p\left(r_i \leqslant x\right)\right] p\left(r_n=x\right) \cdot n.
\end{aligned}

** 2.4.2
*If each* \(r_a\) *is uniformly distributed between* \(0\) *and* \(1\), *calculate the mean and variance of* \(x\) *as a function of* \(n\), *and comment on their behavior at large* \(n\).

Given
\begin{align*}
p(r)= 
\begin{cases}
1 & 0 \leqslant r \leqslant 1 \\
0 & \text {otherwise}
\end{cases},
\end{align*}

we can write down a functional form for \(p_{n} (x)\)

\begin{aligned}
p_n(x)=\left[\int_0^x d r\right]^{n-1} \cdot x \cdot n=n x^{n-1}=\frac{d}{d x}\left(x^n\right).
\end{aligned}

The first and second moments are

\begin{aligned}
\langle x\rangle=n \int_0^1 x^n d x=n /(n+1), \qquad \langle x^2 \rangle = n \int_0^1 x^{n+1}\,dx = n / (n + 2).
\end{aligned}

In general we have \(\langle x^m\rangle=n /(n+m)\). The cumulants are easily obtained from the moments

\begin{align*}
\langle x \rangle_{c} = \langle x \rangle = n / (n+1), \qquad \langle x^{2} \rangle_{c} = \langle x^{2} \rangle - \langle x \rangle^{2} = n / \big[ (n + 2) (n + 1)^{2} \big].
\end{align*}

For large \(n\), we get \(\lim_{n \to \infty} \langle x \rangle_{c} = 1\), and \(\lim_{n \to \infty} \langle x^{2} \rangle_{c} = 1/n^{2}\). We see that the variance of \(x\) vanishes and the mean approaches the higher extreme of \(r_{\alpha}\)'s support.